DataProcessors/РасчетПоказателейЭффективности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>РасчетПоказателейЭффективности</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПланПоказателейЭффективностиСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПланПоказателейЭффективностиСотрудника</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеЗначенияПоказателейЭффективностиСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Горизонт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказателиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураЦелей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяЭффективности</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ФактПоказателейЭффективностиСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ФактПоказателейЭффективностиСотрудника</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФактическиеЗначенияПоказателейЭффективностиСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Горизонт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказателиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураЦелей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяЭффективности</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктураПредприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетСтруктуреЮридическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/РасчетПоказателейЭффективности/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначенияДляЗаполнения = Новый Структура("Месяц", "Период");
	УстановитьДоступностьИЗначениеПоУмолчанию(ЗначениеЗаполнено(ПодразделениеОтбор), ЭтотОбъект);
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	УстановитьДоступностьИЗначениеПоУмолчанию(ЗначениеЗаполнено(ПодразделениеОтбор), ЭтотОбъект);
	ПриПолученииДанныхНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Отбор = ПолучитьОтборТекущейСтрокиДерева();
	
	Если ИмяСобытия = "Запись_НазначениеПоказателейЭффективности"
		Или ИмяСобытия = "Запись_ПланПоказателейЭффективностиПодразделения"
		Или ИмяСобытия = "Запись_ПланПоказателейЭффективностиПозиции"
		Или ИмяСобытия = "Запись_ПланПоказателяЭффективностиПодразделений"
		Или ИмяСобытия = "Запись_ПланПоказателяЭффективностиПозиций"
		Или ИмяСобытия = "Запись_ФактПоказателейЭффективностиПодразделения"
		Или ИмяСобытия = "Запись_ФактПоказателяЭффективностиПодразделений" Тогда
		ПриПолученииДанныхНаСервере();
	ИначеЕсли ИмяСобытия = "Запись_ПланПоказателейЭффективностиСотрудника"
		Или ИмяСобытия = "Запись_ФактПоказателейЭффективностиСотрудника"
		Или ИмяСобытия = "Запись_ФактПоказателяЭффективностиСотрудников" Тогда
		ОбновитьПоказателиСотрудника(Параметр);
	КонецЕсли;
	
	УстановитьТекущуюСтрокуДерева(Отбор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеОтборПриИзменении(Элемент)
	УстановитьДоступностьИЗначениеПоУмолчанию(ЗначениеЗаполнено(ПодразделениеОтбор), ЭтотОбъект);
	ПриПолученииДанныхНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	КлючевыеПоказателиЭффективностиКлиент.ПериодСтрокойРегулирование(ЭтаФорма, Направление, "Горизонт", "Период", "ПериодСтрокой");
	Модифицированность = Ложь;
	Если ДеревоСотрудников.ПолучитьЭлементы().Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПериодСтрокойРегулированиеНаКлиентеЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные будут обновлены. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПериодСтрокойРегулированиеНаКлиентеЗавершение(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойРегулированиеНаКлиентеЗавершение(РезультатЗакрытия, ДополнительныеПараметры = Неопределено) Экспорт

	Если РезультатЗакрытия = Неопределено
		Или РезультатЗакрытия <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = ПолучитьОтборТекущейСтрокиДерева();
	
	ПриПолученииДанныхНаСервере();
	
	УстановитьТекущуюСтрокуДерева(Отбор);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоСотрудников(Команда)
	
	Если ДеревоСотрудников.ПолучитьЭлементы().Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьДеревоСотрудниковЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные будут обновлены. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбновитьДеревоСотрудниковЗавершение(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоСотрудниковЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат = Неопределено
		Или Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеОбОкончательномРасчете();

КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПриИзмененииДатыНаКлиенте", ЭтотОбъект);
	СтруктураИменРеквизитов = Новый Структура;
	СтруктураИменРеквизитов.Вставить("ИмяРеквизитаПериод", "Период");
	СтруктураИменРеквизитов.Вставить("ИмяРеквизитаПредставленияПериода", "ПериодСтрокой");
	СтруктураИменРеквизитов.Вставить("ИмяРеквизитаГоризонт", "Горизонт");
	
	КлючевыеПоказателиЭффективностиКлиент.ВыбратьПериод(ЭтаФорма, ОповещениеОЗакрытии, СтруктураИменРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСПоказателямиПриИзменении(Элемент)
	ПриПолученииДанныхНаСервере();
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетКартаПоказателейЭффективностиФакт(Команда)
	
	ОтборПоСотрудникуЗаполнен = Элементы.ТаблицаОценокПоказателейСотрудников.ОтборСтрок <> Неопределено
		И ЗначениеЗаполнено(Элементы.ТаблицаОценокПоказателейСотрудников.ОтборСтрок["Сотрудник"]);
	Если НЕ ОтборПоСотрудникуЗаполнен Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Не выбран сотрудник.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОтчета = ПодготовитьПараметрыОтчета("КартаПоказателейЭффективностиФакт");
	ОткрытьФорму("Отчет.КартаЦелевыхПоказателейЭффективности.Форма", ПараметрыОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетКартаПоказателейЭффективностиПлан(Команда)

	ОтборПоСотрудникуЗаполнен = Элементы.ТаблицаОценокПоказателейСотрудников.ОтборСтрок <> Неопределено
		И ЗначениеЗаполнено(Элементы.ТаблицаОценокПоказателейСотрудников.ОтборСтрок["Сотрудник"]);
	Если НЕ ОтборПоСотрудникуЗаполнен Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Не выбран сотрудник.'"));
		Возврат;
	КонецЕсли;

	ПараметрыОтчета = ПодготовитьПараметрыОтчета("КартаПоказателейЭффективностиПлан");
	ОткрытьФорму("Отчет.КартаЦелевыхПоказателейЭффективности.Форма", ПараметрыОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоСотрудников

&НаКлиенте
Процедура ДеревоСотрудниковПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборОценкамПоказателей(ЭтаФорма, Элементы.ДеревоСотрудников.ТекущиеДанные);
	СформироватьСтрокуВладельцаПоказателя(ЭтаФорма, Элементы.ДеревоСотрудников.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "ДеревоСотрудниковЗначениеСтроки" Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, Элемент.ТекущиеДанные.ЗначениеСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОценокПоказателейСотрудников

&НаКлиенте
Процедура ТаблицаОценокПоказателейСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаОценокПоказателейСотрудниковПланПоказателя"
		Или Поле.Имя = "ТаблицаОценокПоказателейСотрудниковФактПоказателя" Тогда
		ОткрытьРегистраторПланаФакта(Элемент, Поле);
	ИначеЕсли Поле.Имя = "ТаблицаОценокПоказателейСотрудниковПоказатель" Тогда
		ОткрытьРегистраторНазначения(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОценокПоказателейСотрудниковПриАктивизацииСтроки(Элемент)
	СформироватьСтрокуРасшифровкиОценкиПоказателя(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВвестиПланПоказателей(Команда)
	ОткрытьНовыйПланСотрудникаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ВвестиФактПоказателей(Команда)
	ОткрытьНовыйФактСотрудникаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоСотрудников(Команда)
	
	Для Каждого СтрокаДереваСотрудников Из ДеревоСотрудников.ПолучитьЭлементы() Цикл
		Элементы.ДеревоСотрудников.Свернуть(СтрокаДереваСотрудников.ПолучитьИдентификатор());
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоСотрудников(Команда)
	
	Для Каждого СтрокаДереваСотрудников Из ДеревоСотрудников.ПолучитьЭлементы() Цикл
		Элементы.ДеревоСотрудников.Развернуть(СтрокаДереваСотрудников.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()

	Если Не ЗначениеЗаполнено(Горизонт) Тогда
		Горизонт = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
	КонецЕсли;
	
	ЦветаСтиляПоясняющийТекст = ЦветаСтиля.ПоясняющийТекст;
	
	ЗаполнитьДанныеОбОкончательномРасчете();
	
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	КлючевыеПоказателиЭффективностиКлиентСервер.УстановитьПредставлениеПериодаПоДате(ЭтаФорма, "Горизонт", "Период");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьИЗначениеПоУмолчанию(ЕстьОтборПоПодразделению, Форма)

	Если ЕстьОтборПоПодразделению Тогда
		Форма.Элементы.СотрудникиСПоказателями.Доступность = Истина;
	Иначе
		Форма.Элементы.СотрудникиСПоказателями.Доступность = Ложь;
		Форма.СотрудникиСПоказателями = Истина;
	КонецЕсли;
	
КонецПроцедуры

#Область ОценкиПоказателей

&НаСервере
Процедура ЗаполнитьДанныеОбОкончательномРасчете()

	Если (Не ЗначениеЗаполнено(ПодразделениеОтбор)
		Или Не ЗначениеЗаполнено(Период))
		И Не СотрудникиСПоказателями Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьВТ = Новый Массив;
	
	СтруктураДат = КлючевыеПоказателиЭффективностиКлиентСервер.ДатыПериодаГоризонта(Период, Горизонт);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Определяем список позиций.
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ДатаОкончания КАК Период,
		|	СтруктураПредприятия.Ссылка КАК Подразделение
		|ПОМЕСТИТЬ ВТПодразделенияОтбор
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Ссылка В ИЕРАРХИИ(&Подразделение)";
		
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеОтбор);
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураДат.ДатаОкончания);
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТПодразделенияОтбор");
	
	ОрганизационнаяСтруктура.СоздатьВТПозицииПодразделений(Запрос.МенеджерВременныхТаблиц, "ВТПодразделенияОтбор");
	УдалитьВТ.Добавить("ВТПозицииПодразделений");
	
	// Получаем сотрудников, работавших в периоде на этих местах
	КлючевыеПоказателиЭффективности.СоздатьВТПериодыРаботыСотрудниковПоСпискуПозиций(Запрос.МенеджерВременныхТаблиц, "ВТПозицииПодразделений", СтруктураРеквизитовФормы());
	УдалитьВТ.Добавить("ВТПериодыРаботыСотрудников");
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ВТПериодыРаботыСотрудников.Позиция КАК Позиция,
	|	МИНИМУМ(ВТПериодыРаботыСотрудников.ДатаНачала) КАК Период
	|ПОМЕСТИТЬ ВТСгруппированныеПериоды
	|ИЗ
	|	ВТПериодыРаботыСотрудников КАК ВТПериодыРаботыСотрудников
	|ГДЕ
	|	ВТПериодыРаботыСотрудников.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПериодыРаботыСотрудников.Сотрудник,
	|	ВТПериодыРаботыСотрудников.Позиция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Горизонт КАК Горизонт,
	|	ПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ПериодыРаботыСотрудников.Период КАК Период,
	|	&ДатаНачала КАК ДатаНачала,
	|	&ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТСотрудникиОтбор
	|ИЗ
	|	ВТСгруппированныеПериоды КАК ПериодыРаботыСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ВТПериодыРаботыСотрудников.Позиция КАК Позиция,
	|	ВТПериодыРаботыСотрудников.ДатаНачала КАК ДатаНачала,
	|	ВТПериодыРаботыСотрудников.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	ВТПериодыРаботыСотрудников КАК ВТПериодыРаботыСотрудников
	|ГДЕ
	|	ВТПериодыРаботыСотрудников.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Горизонт", Горизонт);
	Запрос.УстановитьПараметр("ДатаНачала", СтруктураДат.ДатаНачала);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	УдалитьВТ.Добавить("ВТСгруппированныеПериоды");
	УдалитьВТ.Добавить("ВТСотрудникиОтбор");
	
	РезультатТаблицаПериодов = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1];
	
	ПерезаполнитьТаблицуОценокПоказателейСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОтбор");

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПериодыРаботыСотрудников.Сотрудник КАК ЗначениеСтроки,
	|	ВТПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ВТПериодыРаботыСотрудников.Позиция КАК Позиция,
	|	ВЫРАЗИТЬ(ВТПериодыРаботыСотрудников.Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец КАК Организация,
	|	ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК МестоВСтруктуреПредприятия,
	|	ВТПериодыРаботыСотрудников.Подразделение КАК Подразделение
	|ИЗ
	|	ВТПериодыРаботыСотрудников КАК ВТПериодыРаботыСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСгруппированныеПериоды КАК СгруппированныеПериоды
	|		ПО ВТПериодыРаботыСотрудников.Сотрудник = СгруппированныеПериоды.Сотрудник
	|		И ВТПериодыРаботыСотрудников.Позиция = СгруппированныеПериоды.Позиция
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестаПозицийВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|		ПО ВТПериодыРаботыСотрудников.Позиция = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция
	|		И СгруппированныеПериоды.Период = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Период
	|ГДЕ (&СотрудникиСПоказателями = Ложь ИЛИ ВТПериодыРаботыСотрудников.Сотрудник В(&МассивСотрудников))
	|ИТОГИ ПО
	|	&ПолеОрганизация
	|	Подразделение ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("МассивСотрудников", ?(СотрудникиСПоказателями, ТаблицаОценокПоказателейСотрудников.Выгрузить(,"Сотрудник"), Новый Массив()));
	Запрос.УстановитьПараметр("СотрудникиСПоказателями", СотрудникиСПоказателями);
	Если ЗначениеЗаполнено(ПодразделениеОтбор) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ПолеОрганизация", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ПолеОрганизация", "Организация,");
	КонецЕсли;
	РезультатДерево = Запрос.Выполнить();
	ПериодыРаботыСотрудников.Загрузить(РезультатТаблицаПериодов.Выгрузить());
	ЗаполнитьДеревоСотрудников(РезультатДерево);
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТаблицуОценокПоказателейСотрудников(МенеджерВременныхТаблиц, ИмяОтбора)
	
	ТаблицаОценокПоказателейСотрудников.Очистить();
	ЗаполнитьТаблицаОценокПоказателейСотрудников(МенеджерВременныхТаблиц, ИмяОтбора);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоСотрудников(РезультатДерево)
	
	ДеревоСотрудников.ПолучитьЭлементы().Очистить();
	ДеревоРезультат = РезультатДерево.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ДополнитьДеревоСотрудников(ДеревоРезультат, ДеревоСотрудников);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьДеревоСотрудников(ДеревоИсточник, ДеревоПриемник)
	
	СтрокиПриемника = ДеревоПриемник.ПолучитьЭлементы();
	
	Для Каждого СтрокаИсточника Из ДеревоИсточник.Строки Цикл
		
		ЗначениеСтроки = ?(ЗначениеЗаполнено(СтрокаИсточника.Сотрудник), СтрокаИсточника.Сотрудник, СтрокаИсточника.Подразделение);
			
		Если ТипЗнч(ДеревоПриемник) = Тип("ДанныеФормыЭлементДерева") И ДеревоПриемник.ЗначениеСтроки = ЗначениеСтроки Тогда 
			ДополнитьДеревоСотрудников(СтрокаИсточника, ДеревоПриемник);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаИсточника Из ДеревоИсточник.Строки Цикл
		
		Если ЗначениеЗаполнено(СтрокаИсточника.Организация)
			И Не ЗначениеЗаполнено(СтрокаИсточника.Подразделение)
			И Не ЗначениеЗаполнено(СтрокаИсточника.Сотрудник) Тогда
			ЗначениеСтроки = СтрокаИсточника.Организация;
		Иначе
			ЗначениеСтроки = ?(ЗначениеЗаполнено(СтрокаИсточника.Сотрудник), СтрокаИсточника.Сотрудник, СтрокаИсточника.Подразделение);
		КонецЕсли;
			
		КартинкаСтроки = ?(ЗначениеЗаполнено(СтрокаИсточника.Сотрудник), 2, 1);
			
		Если ТипЗнч(ДеревоПриемник) = Тип("ДанныеФормыЭлементДерева") И ДеревоПриемник.ЗначениеСтроки = ЗначениеСтроки Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаПриемника = СтрокиПриемника.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		СтрокаПриемника.ЗначениеСтроки = ЗначениеСтроки;
		СтрокаПриемника.КартинкаСтроки = КартинкаСтроки;
		ЗаполнитьИтоговуюОценкуПоказателяСотрудника(СтрокаПриемника);
		
		ДополнитьДеревоСотрудников(СтрокаИсточника, СтрокаПриемника);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборОценкамПоказателей(Форма, ТекущиеДанные = Неопределено)
	
	ОтборСтрок = Новый Структура;
	
	Если ТекущиеДанные = Неопределено
		Или Не ЗначениеЗаполнено(ТекущиеДанные.Сотрудник)
		Или Не ЗначениеЗаполнено(ТекущиеДанные.Позиция) Тогда
		ОтборСтрок.Вставить("Сотрудник", ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));
		ОтборСтрок.Вставить("Позиция", ПредопределенноеЗначение("Справочник.ШтатноеРасписание.ПустаяСсылка"));
		ОтборСтрок.Вставить("МестоВСтруктуреПредприятия", ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
		Форма.Элементы.ТаблицаОценокПоказателейСотрудников.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	Иначе
		ОтборСтрок.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
		ОтборСтрок.Вставить("Позиция", ТекущиеДанные.Позиция);
		ОтборСтрок.Вставить("МестоВСтруктуреПредприятия", ТекущиеДанные.МестоВСтруктуреПредприятия);
		Форма.Элементы.ТаблицаОценокПоказателейСотрудников.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоговуюОценкуПоказателяСотрудника(ТекущиеДанные)

	Если Не ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	ИтоговаяОценкаПоказателя = 0;
	ТекущиеДанные.ПолностьюРассчитан = Истина;
	
	НайденныеСтроки = ТаблицаОценокПоказателейСотрудников.НайтиСтроки(Новый Структура("Сотрудник, Позиция", ТекущиеДанные.Сотрудник, ТекущиеДанные.Позиция));
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ТекущиеДанные.ВладелецПоказателя = НайденнаяСтрока.ВладелецПоказателя;
		Если НайденнаяСтрока.Рассчитан Тогда
			ИтоговаяОценкаПоказателя = ИтоговаяОценкаПоказателя + НайденнаяСтрока.УдельнаяОценкаПоказателя;
			ТекущиеДанные.ЕстьРассчитанныеЗначения = Истина;
		Иначе
			ТекущиеДанные.ПолностьюРассчитан = Ложь;
		КонецЕсли;
	КонецЦикла; 
	
	ТекущиеДанные.ИтоговаяОценкаПоказателя = Окр(ИтоговаяОценкаПоказателя, 2);
	
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьСтрокуВладельцаПоказателя(Форма, ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.ВладелецПоказателя) Тогда
		Форма.Элементы.СтрокаВладельцаПоказателя.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.СтрокаВладельцаПоказателя.Видимость = Истина;
	
	МассивСтрок = Новый Массив;
	
	// Сотрудник
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Сотрудник работает на позиции'"),, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(" ");
	// Позиция
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Строка(ТекущиеДанные.Позиция)));
	
	// Периоды работы.
	ПериодыРаботы = Форма.ПериодыРаботыСотрудников.НайтиСтроки(Новый Структура("Сотрудник, Позиция", ТекущиеДанные.Сотрудник, ТекущиеДанные.Позиция));
	МассивСтрокПериодов = МассивСтрокПериодовРаботы(Форма, ПериодыРаботы);
	Если МассивСтрокПериодов.Количество() > 0 Тогда
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(", ",, Форма.ЦветаСтиляПоясняющийТекст));
		Если ПериодыРаботы.Количество() = 1 Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'в периоде'"),, Форма.ЦветаСтиляПоясняющийТекст));
		Иначе
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'в периодах'"),, Форма.ЦветаСтиляПоясняющийТекст));
		КонецЕсли;
		МассивСтрок.Добавить(" ");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтрок, МассивСтрокПериодов);
	КонецЕсли;
	
	МассивСтрок.Добавить(Символы.ПС);
	
	// Набор показателей.
	Если ТипЗнч(ТекущиеДанные.ВладелецПоказателя) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		ТекстВладельца = НСтр("ru = 'подразделение'");
	ИначеЕсли ТипЗнч(ТекущиеДанные.ВладелецПоказателя) = Тип("СправочникСсылка.Сотрудники") Тогда
		ТекстВладельца = НСтр("ru = 'сотрудника'");
	Иначе
		ТекстВладельца = НСтр("ru = 'позицию'");
	КонецЕсли;
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Набор показателей, действующих на него, назначен на %1'"), ТекстВладельца),, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Строка(ТекущиеДанные.ВладелецПоказателя)));
	
	Форма.СтрокаВладельцаПоказателя = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МассивСтрокПериодовРаботы(Форма, СтрокиПериодов)

	МассивСтрок = Новый Массив;
	
	Для каждого СтрокаПериода Из СтрокиПериодов Цикл
		Если СтрокиПериодов.Найти(СтрокаПериода) > 0 Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(", ",, Форма.ЦветаСтиляПоясняющийТекст));
		КонецЕсли;
		
		МассивСтрок.Добавить(НСтр("ru = 'с'"));
		МассивСтрок.Добавить(" ");
		МассивСтрок.Добавить(Формат(СтрокаПериода.ДатаНачала,"ДЛФ=D"));
		МассивСтрок.Добавить(" ");
		МассивСтрок.Добавить(НСтр("ru = 'по'"));
		МассивСтрок.Добавить(" ");
		МассивСтрок.Добавить(Формат(СтрокаПериода.ДатаОкончания, "ДЛФ=D"));
		
	КонецЦикла;

	Возврат МассивСтрок;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьСтрокуРасшифровкиОценкиПоказателя(Форма)
	
	ТекущиеДанные = Форма.Элементы.ТаблицаОценокПоказателейСотрудников.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ТекущиеДанные.Рассчитан Тогда
		Форма.Элементы.СтрокаРасшифровкиОценкиПоказателя.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.СтрокаРасшифровкиОценкиПоказателя.Видимость = Истина;
	МассивСтрок = Новый Массив;
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Итоговая оценка показателя:'"),, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Формат(ТекущиеДанные.УдельнаяОценкаПоказателя, "ЧН=0,00")));
	МассивСтрок.Добавить(" = ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Формат(ТекущиеДанные.ОценкаПоказателя, "ЧН=0,00")));
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '(оценка показателя)'"),, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(" * ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Формат(ТекущиеДанные.УдельныйВес, "ЧН=0,00")));
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '(доля показателя в итоговой оценке).'"),, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(Символы.ПС);
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Значение показателя'"),, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" - ",, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Формат(ТекущиеДанные.ЗначениеПоказателя, "ЧН=0,00")));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(", ",, Форма.ЦветаСтиляПоясняющийТекст));
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'располагается на отрезке шкалы'"),, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(" ");
	
	ТекстШкалы = """" + КлючевыеПоказателиЭффективностиКлиентСервер.ТекстШкалыПоОтрезку(ТекущиеДанные.ЗначениеОт, ТекущиеДанные.ЗначениеДо) + """";
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ТекстШкалы));
	МассивСтрок.Добавить(Символы.ПС);
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Оценка показателя, рассчитанная по данному отрезку шкалы значений'"),, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" - ",, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Формат(ТекущиеДанные.ОценкаПоказателя, "ЧН=0,00")));
	МассивСтрок.Добавить(".");
	МассивСтрок.Добавить(Символы.ПС);
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Вес показателя'"),, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" - ",, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Формат(ТекущиеДанные.Вес, "ЧН=0")));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(". ",, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Доля показателя в итоговой оценке'"),, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" - ",, Форма.ЦветаСтиляПоясняющийТекст));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Формат(ТекущиеДанные.УдельныйВес, "ЧН=0,00")));
	МассивСтрок.Добавить(".");
	
	Форма.СтрокаРасшифровкиОценкиПоказателя = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументНаКлиенте(ТекущиеДанныеРегистратор)

	Если Не ЗначениеЗаполнено(ТекущиеДанныеРегистратор) Тогда
		Возврат;
	КонецЕсли;

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ", ТекущиеДанныеРегистратор);
	
	ОткрытьФорму("Документ." + ИмяДокументаНаСервере(ТекущиеДанныеРегистратор) + ".Форма.ФормаДокумента", СтруктураПараметров, ЭтотОбъект, УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Функция ИмяДокументаНаСервере(ДокументСсылка)
	Возврат ДокументСсылка.Метаданные().Имя;
КонецФункции

&НаКлиенте
Процедура ОткрытьНовыйПланСотрудникаНаКлиенте()

	ОтборСтрок = Элементы.ТаблицаОценокПоказателейСотрудников.ОтборСтрок;
	Подразделение = ОтборСтрок.МестоВСтруктуреПредприятия;
	Сотрудник = ОтборСтрок.Сотрудник;
	Позиция = ОтборСтрок.Позиция;
	
	Показатели = Новый Массив;
	
	СтрокиСотрудника = ТаблицаОценокПоказателейСотрудников.НайтиСтроки(Новый Структура(ОтборСтрок));
	Для каждого СтрокаСотрудника Из СтрокиСотрудника Цикл
		Если ЗначениеЗаполнено(СтрокаСотрудника.ПланПоказателя) Или Не СтрокаСотрудника.ТребуетсяВводПлана Тогда
			Продолжить;
		КонецЕсли;
		Показатели.Добавить(СтрокаСотрудника.Показатель);
	КонецЦикла;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения(Сотрудник, Показатели, Позиция, Подразделение));
	
	ОткрытьФорму("Документ.ПланПоказателейЭффективностиСотрудника.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовыйФактСотрудникаНаКлиенте()

	ОтборСтрок = Элементы.ТаблицаОценокПоказателейСотрудников.ОтборСтрок;
	Подразделение = ОтборСтрок.МестоВСтруктуреПредприятия;
	Сотрудник = ОтборСтрок.Сотрудник;
	Позиция = ОтборСтрок.Позиция;
	
	Показатели = Новый Массив;
	
	СтрокиСотрудника = ТаблицаОценокПоказателейСотрудников.НайтиСтроки(Новый Структура(ОтборСтрок));
	Для каждого СтрокаСотрудника Из СтрокиСотрудника Цикл
		Если ЗначениеЗаполнено(СтрокаСотрудника.ФактПоказателя) Тогда
			Продолжить;
		КонецЕсли;
		Показатели.Добавить(СтрокаСотрудника.Показатель);
	КонецЦикла;
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения(Сотрудник, Показатели, Позиция, Подразделение));
	
	ОткрытьФорму("Документ.ФактПоказателейЭффективностиСотрудника.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Функция ЗначенияЗаполнения(Сотрудник, Показатели, Позиция, Подразделение)

	ЗначенияЗаполнения = Новый Структура;
	
	ЗначенияЗаполнения.Вставить("Период", Период);
	ЗначенияЗаполнения.Вставить("Горизонт", Горизонт);
	Если Не ЗначениеЗаполнено(ПодразделениеОтбор) Тогда
		ЗначенияЗаполнения.Вставить("Подразделение", Подразделение);
	Иначе
		ЗначенияЗаполнения.Вставить("Подразделение", ПодразделениеОтбор);
	КонецЕсли;
	
	ЗначенияЗаполнения.Вставить("Сотрудник", Сотрудник);
	ЗначенияЗаполнения.Вставить("Показатели", Показатели);
	ЗначенияЗаполнения.Вставить("Позиция", Позиция);
	
	Возврат ЗначенияЗаполнения;

КонецФункции

&НаКлиенте
Процедура ОбновитьПоказателиСотрудника(Сотрудники)

	Если Сотрудники = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПоказателиСотрудникаНаСервере(Сотрудники);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказателиСотрудникаНаСервере(Сотрудники)
	
	МассивСотрудников = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Сотрудники);
	
	ТаблицаОтбор = Новый ТаблицаЗначений;
	ТаблицаОтбор.Колонки.Добавить("Горизонт", Новый ОписаниеТипов("ПеречислениеСсылка.Периодичность"));
	ТаблицаОтбор.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаОтбор.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаОтбор.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	ТаблицаОтбор.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	СтруктураДат = КлючевыеПоказателиЭффективностиКлиентСервер.ДатыПериодаГоризонта(Период, Горизонт);
	
	Для каждого Сотрудник Из МассивСотрудников Цикл
		ОтборПоСотруднику = Новый Структура("Сотрудник", Сотрудник);
		
		ПериодыРаботыСотрудника = ПериодыРаботыСотрудников.Выгрузить(ОтборПоСотруднику);
		РабочиеМестаСотрудника = РабочиеМестаПоПериодамРаботыСотрудника(ПериодыРаботыСотрудника);
		
		Для каждого РабочееМесто Из РабочиеМестаСотрудника Цикл
			НоваяСтрока = ТаблицаОтбор.Добавить();
			НоваяСтрока.Горизонт = Горизонт;
			НоваяСтрока.Сотрудник = РабочееМесто.Сотрудник;
			НоваяСтрока.Период = РабочееМесто.ДатаНачала;
			НоваяСтрока.ДатаНачала = СтруктураДат.ДатаНачала;
			НоваяСтрока.ДатаОкончания = СтруктураДат.ДатаОкончания;
		КонецЦикла; 
		
		// Очистка старых строк.
		УдаляемыеСтроки = ТаблицаОценокПоказателейСотрудников.НайтиСтроки(ОтборПоСотруднику);
		Для каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			ТаблицаОценокПоказателейСотрудников.Удалить(УдаляемаяСтрока);
		КонецЦикла;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаОтбор.Сотрудник КАК Сотрудник,
		|	ТаблицаОтбор.Горизонт КАК Горизонт,
		|	ТаблицаОтбор.Период КАК Период,
		|	ТаблицаОтбор.ДатаНачала КАК ДатаНачала,
		|	ТаблицаОтбор.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудникиОтбор
		|ИЗ
		|	&ТаблицаОтбор КАК ТаблицаОтбор";
	Запрос.УстановитьПараметр("ТаблицаОтбор", ТаблицаОтбор);
	
	Запрос.Выполнить();
	
	ЗаполнитьТаблицаОценокПоказателейСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОтбор");
	
	ОбновитьИтоговыеОценкиПоказателейСотрудников(ТаблицаОтбор);

КонецПроцедуры

&НаСервере
Функция РабочиеМестаПоПериодамРаботыСотрудника(ПериодыРаботыСотрудника)
	
	ИтоговыеПериоды = ПериодыРаботыСотрудников.Выгрузить().СкопироватьКолонки();
	
	Для каждого ПериодРаботы Из ПериодыРаботыСотрудника Цикл
		НайденныеСтроки = ИтоговыеПериоды.НайтиСтроки(Новый Структура("Сотрудник, Позиция", ПериодРаботы.Сотрудник, ПериодРаботы.Позиция));
		Если НайденныеСтроки.Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(ИтоговыеПериоды.Добавить(), ПериодРаботы);
		Иначе
			НайденныеСтроки[0].ДатаНачала = Мин(НайденныеСтроки[0].ДатаНачала, ПериодРаботы.ДатаНачала);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ИтоговыеПериоды;

КонецФункции

&НаСервере
Процедура ОбновитьИтоговыеОценкиПоказателейСотрудников(ТаблицаСотрудников)

	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоСотрудников");
	
	Для каждого СтрокаСотрудника Из ТаблицаСотрудников Цикл
		СтруктураПоиска = Новый Структура("Сотрудник", СтрокаСотрудника.Сотрудник);
		НайденныеСтроки = ДеревоЗначений.Строки.НайтиСтроки(СтруктураПоиска, Истина);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ЗаполнитьИтоговуюОценкуПоказателяСотрудника(НайденнаяСтрока);
		КонецЦикла; 
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоСотрудников");

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистраторНазначения(Элемент)

	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ", ТекущиеДанные.РегистраторПоказателя);
	
	ОткрытьФорму("Документ.НазначениеПоказателейЭффективности.Форма.ФормаДокумента", СтруктураПараметров, ЭтотОбъект, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистраторПланаФакта(Элемент, Поле)

	ОтборСтрок = Элементы.ТаблицаОценокПоказателейСотрудников.ОтборСтрок;
	Если ОтборСтрок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ТаблицаОценокПоказателейСотрудниковПланПоказателя" Тогда
		ОткрытьДокументНаКлиенте(Элемент.ТекущиеДанные.РегистраторПлана);
	ИначеЕсли Поле.Имя = "ТаблицаОценокПоказателейСотрудниковФактПоказателя" Тогда
		ОткрытьДокументНаКлиенте(Элемент.ТекущиеДанные.РегистраторФакта);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицаОценокПоказателейСотрудников(МенеджерВременныхТаблиц, ИмяОтбора)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	КлючевыеПоказателиЭффективности.СоздатьВТОценкиПоказателейСотрудников(Запрос.МенеджерВременныхТаблиц, ИмяОтбора);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОценкиПоказателейСотрудников.Период КАК Период,
		|	ОценкиПоказателейСотрудников.Позиция КАК Позиция
		|ПОМЕСТИТЬ ВТПозиции
		|ИЗ
		|	ВТОценкиПоказателейСотрудников КАК ОценкиПоказателейСотрудников";
	
	Запрос.Выполнить();
	
	ОрганизационнаяСтруктура.СоздатьВТМестаПозицийВСтруктуреПредприятияПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОценкиПоказателейСотрудников.Сотрудник КАК Сотрудник,
		|	ОценкиПоказателейСотрудников.Позиция КАК Позиция,
		|	ОценкиПоказателейСотрудников.Показатель КАК Показатель,
		|	ОценкиПоказателейСотрудников.РегистраторНазначенияПоказателей КАК РегистраторПоказателя,
		|	ОценкиПоказателейСотрудников.ТребуетсяВводПлана КАК ТребуетсяВводПлана,
		|	ОценкиПоказателейСотрудников.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ОценкиПоказателейСотрудников.Вес КАК Вес,
		|	ОценкиПоказателейСотрудников.УдельныйВес КАК УдельныйВес,
		|	ОценкиПоказателейСотрудников.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	ОценкиПоказателейСотрудников.ЗначениеОт КАК ЗначениеОт,
		|	ОценкиПоказателейСотрудников.ЗначениеДо КАК ЗначениеДо,
		|	ОценкиПоказателейСотрудников.ПлановоеЗначение КАК ПланПоказателя,
		|	ОценкиПоказателейСотрудников.ФактическоеЗначение КАК ФактПоказателя,
		|	ОценкиПоказателейСотрудников.ОценкаПоказателя КАК ОценкаПоказателя,
		|	ОценкиПоказателейСотрудников.УдельнаяОценкаПоказателя КАК УдельнаяОценкаПоказателя,
		|	ОценкиПоказателейСотрудников.РегистраторПлановогоЗначения КАК РегистраторПлана,
		|	ОценкиПоказателейСотрудников.РегистраторФактическогоЗначения КАК РегистраторФакта,
		|	ВЫБОР
		|		КОГДА ОценкиПоказателейСотрудников.УдельнаяОценкаПоказателя ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Рассчитан,
		|	ЕСТЬNULL(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК МестоВСтруктуреПредприятия
		|ИЗ
		|	ВТОценкиПоказателейСотрудников КАК ОценкиПоказателейСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестаПозицийВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
		|		ПО ОценкиПоказателейСотрудников.Позиция = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция
		|			И ОценкиПоказателейСотрудников.Период = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	Позиция,
		|	Показатель";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОценокПоказателейСотрудников.Добавить(), Выборка);
	КонецЦикла;
	
	УстановитьОтборОценкамПоказателей(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДатыНаКлиенте(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Отбор = ПолучитьОтборТекущейСтрокиДерева();
	
	ПриПолученииДанныхНаСервере();
	
	УстановитьТекущуюСтрокуДерева(Отбор);

КонецПроцедуры

&НаСервере
Функция СтруктураРеквизитовФормы()
	
	СтруктураРеквизитов = Новый Структура;
	
	СтруктураРеквизитов.Вставить("Период", Период);
	СтруктураРеквизитов.Вставить("Горизонт", Горизонт);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПользовательскиеНастройкиОтчетаКартыЦелевыхПоказателей(Отбор)
	
	ОтчетОбъект = Отчеты.КартаЦелевыхПоказателейЭффективности.Создать();
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	КомпоновщикНастроек.ЗагрузитьНастройки(ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек.Найти(Отбор.КлючВарианта).Настройки);
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Подразделение", Отбор.Подразделение);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Горизонт", Отбор.Горизонт);

	СтруктураДат = КлючевыеПоказателиЭффективностиКлиентСервер.ДатыПериодаГоризонта(Отбор.Период, Отбор.Горизонт);
	ПериодОтчета = Новый СтандартныйПериод(СтруктураДат.ДатаНачала, СтруктураДат.ДатаОкончания);
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета", ПериодОтчета);
	
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник") Тогда
			ЭлементОтбора.ПравоеЗначение = Отбор.Сотрудник;
			ЭлементОтбора.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КомпоновщикНастроек.ПользовательскиеНастройки;
	
КонецФункции

&НаСервере
Функция ПодготовитьПараметрыОтчета(ВариантОтчета)
	
	СписокСотрудников = Новый СписокЗначений;
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ДеревоСотрудников.ВыделенныеСтроки Цикл
		ВыделеннаяСтрока = ДеревоСотрудников.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		Если ВыделеннаяСтрока <> Неопределено И ЗначениеЗаполнено(ВыделеннаяСтрока.Сотрудник) Тогда
			СписокСотрудников.Добавить(ВыделеннаяСтрока.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПользовательскихНастроек = Новый Структура;
	ПараметрыПользовательскихНастроек.Вставить("Подразделение", ПодразделениеОтбор);
	ПараметрыПользовательскихНастроек.Вставить("Сотрудник", СписокСотрудников);
	ПараметрыПользовательскихНастроек.Вставить("КлючВарианта", ВариантОтчета);
	ПараметрыПользовательскихНастроек.Вставить("Горизонт", Горизонт);
	ПараметрыПользовательскихНастроек.Вставить("Период", Период);
	
	ПользовательскиеНастройкиОтчета = ПользовательскиеНастройкиОтчетаКартыЦелевыхПоказателей(ПараметрыПользовательскихНастроек);
	
	ПараметрыОтчета = Новый Структура("СформироватьПриОткрытии, КлючВарианта, ПользовательскиеНастройки",
		Истина, ВариантОтчета, ПользовательскиеНастройкиОтчета);
	
	Возврат ПараметрыОтчета;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОтборТекущейСтрокиДерева()
	
	Отбор = Новый Структура("Подразделение, Сотрудник, Позиция");
	
	Если Элементы.ДеревоСотрудников.ТекущиеДанные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Отбор, Элементы.ДеревоСотрудников.ТекущиеДанные);
	КонецЕсли;
	
	Возврат Отбор;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекущуюСтрокуДерева(Отбор)
	
	ИдентификаторСтроки = 0;
	НайтиСтрокуВДеревеСотрудников(ДеревоСотрудников.ПолучитьЭлементы(), Отбор, Ложь, ИдентификаторСтроки);
	Элементы.ДеревоСотрудников.ТекущаяСтрока = ИдентификаторСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСтрокуВДеревеСотрудников(КоллекцияЭлементовДерева, Отбор, ПрекратитьПоиск, ИдентификаторСтроки) Экспорт
	
	Для Каждого СтрокаДерева Из КоллекцияЭлементовДерева Цикл
		Если ПрекратитьПоиск Тогда
			Возврат;
		КонецЕсли;
		
		Если СтрокаДерева.Подразделение = Отбор.Подразделение
			И СтрокаДерева.Сотрудник = Отбор.Сотрудник
			И СтрокаДерева.Позиция = Отбор.Позиция Тогда
			ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор();
			ПрекратитьПоиск = Истина;
			Возврат;
		КонецЕсли;
		
		КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы();
		
		Если КоллекцияЭлементов.Количество() > 0 Тогда
			НайтиСтрокуВДеревеСотрудников(КоллекцияЭлементов, Отбор, ПрекратитьПоиск, ИдентификаторСтроки);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
